# Clase 3

#### Instalamos Pandas

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\stalin\appdata\local\programs\python\python313\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\stalin\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\stalin\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\stalin\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\stalin\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\stalin\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

* Importando Pandas

In [2]:
import pandas as pd

* Creacion de Data Frame

In [26]:
data = {
    "apples": [3,2,1,0],
    "oranges": [9,8,7,5]
}

In [27]:
data

{'apples': [3, 2, 1, 0], 'oranges': [9, 8, 7, 5]}

In [28]:
index = ["Carlos", "Ana", "Juan", "Gaby"]

In [29]:
df = pd.DataFrame(data,index=index)

In [30]:
df

        apples  oranges
Carlos       3        9
Ana          2        8
Juan         1        7
Gaby         0        5

* Crear un data frame de calificaciones

In [31]:
calificaciones = {
    "Lubswer":[10,10,10,9,6],
    "Alumno1":[8,9,6,10,10],
    "Alumno2":[9,5,9,7,8]
}

In [32]:
calificaciones

{'Lubswer': [10, 10, 10, 9, 6],
 'Alumno1': [8, 9, 6, 10, 10],
 'Alumno2': [9, 5, 9, 7, 8]}

In [33]:
index2 = ["nota1","nota2","nota3","nota4","nota5"]

In [34]:
df = pd.DataFrame(calificaciones,index = index2)

In [35]:
df

       Lubswer  Alumno1  Alumno2
nota1       10        8        9
nota2       10        9        5
nota3       10        6        9
nota4        9       10        7
nota5        6       10        8

In [36]:
df.loc['nota1']

Lubswer    10
Alumno1     8
Alumno2     9
Name: nota1, dtype: int64

* Guardar Data Frame

In [37]:
df.to_csv("listado.csv")

* Guardando en Json

In [38]:
df.to_json("Listado.json")

* Cargando desde csv y json

In [39]:
df1 = pd.read_json("Listado.json")

In [40]:
df2 = pd.read_csv("Listado.csv", index_col=0)

In [41]:
df1

       Lubswer  Alumno1  Alumno2
nota1       10        8        9
nota2       10        9        5
nota3       10        6        9
nota4        9       10        7
nota5        6       10        8

In [42]:
df2

       Lubswer  Alumno1  Alumno2
nota1       10        8        9
nota2       10        9        5
nota3       10        6        9
nota4        9       10        7
nota5        6       10        8

### SQLite

* Conexión con una base de datos:

In [43]:
#pip install pysqlite3 ya viene instalado

* Importar sqlite3

In [44]:
import sqlite3

In [45]:
con = sqlite3.connect("database.db")

In [46]:
df = pd.read_sql_query("SELECT * FROM compras", con)

In [47]:
df

    index  apples  oranges
0    None     NaN      NaN
1   MILKA     3.0      2.0
2  LUBWER     1.0      1.0

In [48]:
df1 = pd.read_sql_query("SELECT * FROM notas", con)

In [49]:
df1

   Alumnos  Programacion  Análisis  Bases de Datos  Etica
0  Carlos              8         5               7      8
1    Milka             9         4               4      7
2    Bryan             5         3               6      7
3     Alan             0         8               3      8

* DataFrame Peliculas

In [50]:
movies_df = pd.read_csv("IMDB-Movie-Data.csv", index_col="Title")

In [51]:
movies_df

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...
Secret in Their Eyes,996,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [52]:
movies_df.head()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [53]:
movies_df.tail()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Secret in Their Eyes,996,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

* Informacion de DATAFRAME

In [54]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Genre               1000 non-null   object
 2   Description         1000 non-null   object
 3   Director            1000 non-null   object
 4   Actors              1000 non-null   object
 5   Year                1000 non-null   int64
 6   Runtime (Minutes)   1000 non-null   int64
 7   Rating              1000 non-null   float64
 8   Votes               1000 non-null   int64
 9   Revenue (Millions)  872 non-null    float64
 10  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(4)
memory usage: 93.8+ KB

* Dimensiones

In [55]:
movies_df.shape

(1000, 11)

**Manejo de duplicados:**

 * Primero vamos a duplicar el contenido del dataset

In [56]:
temp_df = pd.concat([movies_df,movies_df])

* Comprobamos las dimensiones:

In [57]:
temp_df.shape

(2000, 11)

* Eliminar duplicados

In [58]:
temp_df = temp_df.drop_duplicates()

In [59]:
temp_df.shape

(1000, 11)

##### Manejo de valores vacíos

* Buscamos si existen valores vacío:

In [60]:
movies_df.isnull()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,False,False,False,False,False,False,False,False,False,False,False
Prometheus,False,False,False,False,False,False,False,False,False,False,False
Split,False,False,False,False,False,False,False,False,False,False,False
Sing,False,False,False,False,False,False,False,False,False,False,False
Suicide Squad,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
Secret in Their Eyes,False,False,False,False,False,False,False,False,False,True,False
Hostel: Part II,False,False,False,False,False,False,False,False,False,False,False
Step Up 2: The Streets,False,False,False,False,False,False,False,False,False,False,False
Search Party,False,False,False,False,False,False,False,False,False,True,False
Nine Lives,False,False,False,False,False,False,False,False,False,False,False

* Sumarizamos

In [61]:
movies_df.isnull().sum()

Rank                    0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [62]:
m2 = movies_df.dropna()

In [63]:
m2.isnull().sum()

Rank                  0
Genre                 0
Description           0
Director              0
Actors                0
Year                  0
Runtime (Minutes)     0
Rating                0
Votes                 0
Revenue (Millions)    0
Metascore             0
dtype: int64

* Por lo general lo que se hace es llenar con valores tales como la media o mediana:

In [64]:
revenue = movies_df['Revenue (Millions)']

In [65]:
revenue

Title
Guardians of the Galaxy    333.13
Prometheus                 126.46
Split                      138.12
Sing                       270.32
Suicide Squad              325.02
                            ...
Secret in Their Eyes          NaN
Hostel: Part II             17.54
Step Up 2: The Streets      58.01
Search Party                  NaN
Nine Lives                  19.64
Name: Revenue (Millions), Length: 1000, dtype: float64

In [66]:
revenue_mean = revenue.mean()

In [67]:
revenue_mean

np.float64(82.95637614678898)

In [68]:
revenue.fillna(revenue_mean, inplace=True)

In [69]:
movies_df.isnull().sum()

Rank                   0
Genre                  0
Description            0
Director               0
Actors                 0
Year                   0
Runtime (Minutes)      0
Rating                 0
Votes                  0
Revenue (Millions)     0
Metascore             64
dtype: int64

* Reemplazar columnas de metascore

In [70]:
metascore = movies_df['Metascore']

In [71]:
metascore

Title
Guardians of the Galaxy    76.0
Prometheus                 65.0
Split                      62.0
Sing                       59.0
Suicide Squad              40.0
                           ...
Secret in Their Eyes       45.0
Hostel: Part II            46.0
Step Up 2: The Streets     50.0
Search Party               22.0
Nine Lives                 11.0
Name: Metascore, Length: 1000, dtype: float64

In [72]:
metascore_mean = metascore.mean()

In [73]:
metascore_mean

np.float64(58.98504273504273)

In [74]:
movies_df.isnull().sum()

Rank                   0
Genre                  0
Description            0
Director               0
Actors                 0
Year                   0
Runtime (Minutes)      0
Rating                 0
Votes                  0
Revenue (Millions)     0
Metascore             64
dtype: int64

In [75]:
metascore.fillna(metascore_mean, inplace=True)

In [76]:
movies_df.isnull().sum()

Rank                  0
Genre                 0
Description           0
Director              0
Actors                0
Year                  0
Runtime (Minutes)     0
Rating                0
Votes                 0
Revenue (Millions)    0
Metascore             0
dtype: int64

In [77]:
movies_df.describe()

,Rank,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
count,1000.000000,1000.000000,1000.000000,1000.000000,1.000000e+03,1000.000000,1000.000000
mean,500.500000,2012.783000,113.172000,6.723200,1.698083e+05,82.956376,58.985043
std,288.819436,3.205962,18.810908,0.945429,1.887626e+05,96.412043,16.634858
min,1.000000,2006.000000,66.000000,1.900000,6.100000e+01,0.000000,11.000000
25%,250.750000,2010.000000,100.000000,6.200000,3.630900e+04,17.442500,47.750000
50%,500.500000,2014.000000,111.000000,6.800000,1.107990e+05,60.375000,58.985043
75%,750.250000,2016.000000,123.000000,7.400000,2.399098e+05,99.177500,71.000000
max,1000.000000,2016.000000,191.000000,9.000000,1.791916e+06,936.630000,100.000000

* Ejercicio de importar el json

In [79]:
carros = pd.read_json("output.json")

In [ ]:
carros

,id,marca,modelo,año,tipo,color,motor,combustible,precio
0,1,Toyota,Corolla,2021,Sedán,Blanco,1.8L,Gasolina,23000
1,2,Honda,Civic,2022,Sedán,Negro,2.0L,Gasolina,25000
2,3,Ford,Ranger,2020,Pickup,Rojo,2.3L EcoBoost,Diésel,32000
3,4,Chevrolet,Tracker,2023,SUV,Gris,1.2L Turbo,Gasolina,28000
4,5,Hyundai,Tucson,2021,SUV,Azul,2.5L,Gasolina,31000
5,6,Kia,Sportage,2022,SUV,Plateado,2.0L,Gasolina,29500
6,7,Tesla,Model 3,2023,Sedán Eléctrico,Blanco Perla,Eléctrico,Eléctrico,42000
7,8,Nissan,Leaf,2022,Hatchback Eléctrico,Verde,Eléctrico 110 kW,Eléctrico,31000
8,9,Mazda,CX-5,2021,SUV,Rojo,2.5L,Gasolina,33000
9,10,Volkswagen,Amarok,2020,Pickup,Negro,3.0L V6 TDI,Diésel,37000

In [80]:
carros.to_sql("Autos",con)

10